Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" name="DEVCFG3" initval="0xFFFFFFFF">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
            <bitfield caption="USB2 USBID Selection bit" mask="0x400000" name="FUSBIDIO2" values="DEVCFG3__FUSBIDIO2" />
            <bitfield caption="USB2 VBUSON Selection bit" mask="0x800000" name="FVBUSIO2" values="DEVCFG3__FVBUSIO2" />
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
            <bitfield caption="USB1 USBID Selection bit" mask="0x40000000" name="FUSBIDIO1" values="DEVCFG3__FUSBIDIO1" />
            <bitfield caption="USB1 VBUSON Selection bit" mask="0x80000000" name="FVBUSIO1" values="DEVCFG3__FVBUSIO1" />
         </register>
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xF7FAA728">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG" />
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK" />
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT" />
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
            <bitfield caption="VBAT BOR Enable bit" mask="0x80000" name="VBATBOREN" values="DEVCFG2__VBATBOREN" />
            <bitfield caption="Deep Sleep BOR Enable bit" mask="0x100000" name="DSBOREN" values="DEVCFG2__DSBOREN" />
            <bitfield caption="Deep Sleep Watchdog Timer Postscale Select bits" mask="0x3e00000" name="DSWDTPS" values="DEVCFG2__DSWDTPS" />
            <bitfield caption="Deep Sleep Watchdog Timer Reference Clock Select bit" mask="0x4000000" name="DSWDTOSC" values="DEVCFG2__DSWDTOSC" />
            <bitfield caption="Deep Sleep Watchdog Timer Enable bit" mask="0x8000000" name="DSWDTEN" values="DEVCFG2__DSWDTEN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x10000000" name="FDSEN" values="DEVCFG2__FDSEN" />
            <bitfield caption="Brown-out Reset Select Trip Voltage bit" mask="0x20000000" name="BORSEL" values="DEVCFG2__BORSEL" />
            <bitfield caption="USB PLL Enable bit" mask="0x80000000" name="UPLLEN" values="DEVCFG2__UPLLEN" />
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FCF9">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT" />
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000" name="FDMTEN" values="DEVCFG1__FDMTEN" />
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x7FFFF7DB">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN" />
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA" />
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP" />
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN" />
            <bitfield caption="Secondary Oscillator Kick Start Programmability bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Course Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN" />
            <bitfield caption="Primary Oscillator Boost bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST" />
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN" />
         </register>
         <register caption="BOOT FLASH 1 SEQUENCE WORD 0 REGISTER" name="BF1SEQ" initval="0xFFFF0000">
            <bitfield caption="Boot Flash True Sequence Number bits" mask="0xffff" name="TSEQ" values="BF1SEQ3__TSEQ" />
            <bitfield caption="Boot Flash Complement Sequence Number bits" mask="0xffff0000" name="CSEQ" values="BF1SEQ3__CSEQ" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="USB2 USBID Selection bit" name="DEVCFG3__FUSBIDIO2">
         <value caption="USBID pin is controlled by the USB2 module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
