Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
         <register caption="ADC Common Scan Select Register 1" name="ADCCSS1" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000001" name="CSS0" values="ADCCSS1__CSS0" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000002" name="CSS1" values="ADCCSS1__CSS1" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000004" name="CSS2" values="ADCCSS1__CSS2" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000008" name="CSS3" values="ADCCSS1__CSS3" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000010" name="CSS4" values="ADCCSS1__CSS4" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000020" name="CSS5" values="ADCCSS1__CSS5" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000040" name="CSS6" values="ADCCSS1__CSS6" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000080" name="CSS7" values="ADCCSS1__CSS7" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000100" name="CSS8" values="ADCCSS1__CSS8" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000200" name="CSS9" values="ADCCSS1__CSS9" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000400" name="CSS10" values="ADCCSS1__CSS10" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000800" name="CSS11" values="ADCCSS1__CSS11" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00001000" name="CSS12" values="ADCCSS1__CSS12" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00002000" name="CSS13" values="ADCCSS1__CSS13" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00004000" name="CSS14" values="ADCCSS1__CSS14" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00008000" name="CSS15" values="ADCCSS1__CSS15" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00010000" name="CSS16" values="ADCCSS1__CSS16" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00020000" name="CSS17" values="ADCCSS1__CSS17" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00040000" name="CSS18" values="ADCCSS1__CSS18" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00080000" name="CSS19" values="ADCCSS1__CSS19" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x01000000" name="CSS24" values="ADCCSS1__CSS24" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x02000000" name="CSS25" values="ADCCSS1__CSS25" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x04000000" name="CSS26" values="ADCCSS1__CSS26" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x08000000" name="CSS27" values="ADCCSS1__CSS27" />
         </register>
         <register caption="ADC Common Scan Select Register 2" name="ADCCSS2" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00010000" name="CSS48" values="ADCCSS2__CSS48" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00020000" name="CSS49" values="ADCCSS2__CSS49" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00040000" name="CSS50" values="ADCCSS2__CSS50" />
            <bitfield mask="0x00080000" name="CSS51" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00100000" name="CSS52" values="ADCCSS2__CSS52" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00200000" name="CSS53" values="ADCCSS2__CSS53" />
         </register>
         <register caption="ADC Data Ready Status Register 1" name="ADCDSTAT1" offset="0xc0" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000001" name="ARDY0" values="ADCDSTAT1__ARDY0" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000002" name="ARDY1" values="ADCDSTAT1__ARDY1" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000004" name="ARDY2" values="ADCDSTAT1__ARDY2" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000008" name="ARDY3" values="ADCDSTAT1__ARDY3" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000010" name="ARDY4" values="ADCDSTAT1__ARDY4" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000020" name="ARDY5" values="ADCDSTAT1__ARDY5" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000040" name="ARDY6" values="ADCDSTAT1__ARDY6" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000080" name="ARDY7" values="ADCDSTAT1__ARDY7" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000100" name="ARDY8" values="ADCDSTAT1__ARDY8" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000200" name="ARDY9" values="ADCDSTAT1__ARDY9" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000400" name="ARDY10" values="ADCDSTAT1__ARDY10" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000800" name="ARDY11" values="ADCDSTAT1__ARDY11" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00001000" name="ARDY12" values="ADCDSTAT1__ARDY12" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00002000" name="ARDY13" values="ADCDSTAT1__ARDY13" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00004000" name="ARDY14" values="ADCDSTAT1__ARDY14" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00008000" name="ARDY15" values="ADCDSTAT1__ARDY15" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00010000" name="ARDY16" values="ADCDSTAT1__ARDY16" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00020000" name="ARDY17" values="ADCDSTAT1__ARDY17" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00040000" name="ARDY18" values="ADCDSTAT1__ARDY18" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00080000" name="ARDY19" values="ADCDSTAT1__ARDY19" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x01000000" name="ARDY24" values="ADCDSTAT1__ARDY24" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x02000000" name="ARDY25" values="ADCDSTAT1__ARDY25" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x04000000" name="ARDY26" values="ADCDSTAT1__ARDY26" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x08000000" name="ARDY27" values="ADCDSTAT1__ARDY27" />
         </register>
