Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
         <register caption="ADC Early Interrupt Status Register 2" name="ADCEISTAT2" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00010000" name="EIRDY48" values="ADCEISTAT2__EIRDY48" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00020000" name="EIRDY49" values="ADCEISTAT2__EIRDY49" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00040000" name="EIRDY50" values="ADCEISTAT2__EIRDY50" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00080000" name="EIRDY51" values="ADCEISTAT2__EIRDY51" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00100000" name="EIRDY52" values="ADCEISTAT2__EIRDY52" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00200000" name="EIRDY53" values="ADCEISTAT2__EIRDY53" />
         </register>
         <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x400" rw="RW" size="4">
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000002" name="ANEN1" values="ADCANCON__ANEN1" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000004" name="ANEN2" values="ADCANCON__ANEN2" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000008" name="ANEN3" values="ADCANCON__ANEN3" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000010" name="ANEN4" values="ADCANCON__ANEN4" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000020" name="ANEN5" values="ADCANCON__ANEN5" />
            <bitfield caption="Shared ADC Analog and Bias Circuitry Enable bit" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000200" name="WKRDY1" values="ADCANCON__WKRDY1" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000400" name="WKRDY2" values="ADCANCON__WKRDY2" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000800" name="WKRDY3" values="ADCANCON__WKRDY3" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00001000" name="WKRDY4" values="ADCANCON__WKRDY4" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00002000" name="WKRDY5" values="ADCANCON__WKRDY5" />
            <bitfield caption="Shared ADC Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00020000" name="WKIEN1" values="ADCANCON__WKIEN1" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00040000" name="WKIEN2" values="ADCANCON__WKIEN2" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00080000" name="WKIEN3" values="ADCANCON__WKIEN3" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00100000" name="WKIEN4" values="ADCANCON__WKIEN4" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00200000" name="WKIEN5" values="ADCANCON__WKIEN5" />
            <bitfield caption="Shared ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7" />
            <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT" />
         </register>
         <register caption="ADC0 Configuration Register" name="ADC0CFG" offset="0xd00" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC1 Configuration Register" name="ADC1CFG" offset="0xd10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC2 Configuration Register" name="ADC2CFG" offset="0xd20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC3 Configuration Register" name="ADC3CFG" offset="0xd30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC4 Configuration Register" name="ADC4CFG" offset="0xd40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC5 Configuration Register" name="ADC5CFG" offset="0xd50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADC7CFG" offset="0xd70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC System Configuration Register 0" name="ADCSYSCFG0" offset="0xe00" rw="R" size="4">
            <bitfield mask="0x00000001" name="AN0" />
            <bitfield mask="0x00000002" name="AN1" />
            <bitfield mask="0x00000004" name="AN2" />
            <bitfield mask="0x00000008" name="AN3" />
            <bitfield mask="0x00000010" name="AN4" />
            <bitfield mask="0x00000020" name="AN5" />
            <bitfield mask="0x00000040" name="AN6" />
            <bitfield mask="0x00000080" name="AN7" />
            <bitfield mask="0x00000100" name="AN8" />
            <bitfield mask="0x00000200" name="AN9" />
            <bitfield mask="0x00000400" name="AN10" />
            <bitfield mask="0x00000800" name="AN11" />
            <bitfield mask="0x00001000" name="AN12" />
            <bitfield mask="0x00002000" name="AN13" />
            <bitfield mask="0x00004000" name="AN14" />
            <bitfield mask="0x00008000" name="AN15" />
            <bitfield mask="0x00010000" name="AN16" />
            <bitfield mask="0x00020000" name="AN17" />
            <bitfield mask="0x00040000" name="AN18" />
            <bitfield mask="0x00080000" name="AN19" />
            <bitfield mask="0x00100000" name="AN20" />
            <bitfield mask="0x00200000" name="AN21" />
            <bitfield mask="0x00400000" name="AN22" />
            <bitfield mask="0x00800000" name="AN23" />
            <bitfield mask="0x01000000" name="AN24" />
            <bitfield mask="0x02000000" name="AN25" />
            <bitfield mask="0x04000000" name="AN26" />
            <bitfield mask="0x08000000" name="AN27" />
         </register>
         <register caption="ADC System Configuration Register 1" name="ADCSYSCFG1" offset="0xe10" rw="R" size="4">
            <bitfield mask="0x00000002" name="AN33" />
            <bitfield mask="0x00000004" name="AN34" />
            <bitfield mask="0x00000008" name="AN35" />
            <bitfield mask="0x00000010" name="AN36" />
            <bitfield mask="0x00000020" name="AN37" />
            <bitfield mask="0x00000040" name="AN38" />
            <bitfield mask="0x00000080" name="AN39" />
            <bitfield mask="0x00000100" name="AN40" />
            <bitfield mask="0x00000200" name="AN41" />
            <bitfield mask="0x00002000" name="AN45" />
            <bitfield mask="0x00004000" name="AN46" />
            <bitfield mask="0x00008000" name="AN47" />
            <bitfield mask="0x00010000" name="AN48" />
            <bitfield mask="0x00020000" name="AN49" />
            <bitfield mask="0x00040000" name="AN50" />
            <bitfield mask="0x00080000" name="AN51" />
            <bitfield mask="0x00100000" name="AN52" />
            <bitfield mask="0x00200000" name="AN53" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA0" offset="0x600" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA1" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA2" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA3" offset="0x630" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
