Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN15">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN16">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN17">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN18">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN19">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN24">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN25">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN26">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN27">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN48">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN49">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN50">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN51">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN52">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN2__AGIEN53">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS0">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS1">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
