Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR4__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR4__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Enable bit" name="ADCFLTR4__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC3 Module Select bits" name="ADCTRG1__TRGSRC3">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control Variants Only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control Variants Only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control Variants Only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control Variants Only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control Variants Only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control Variants Only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control Variants Only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control Variants Only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control Variants Only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control Variants Only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control Variants Only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control Variants Only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control Variants Only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control Variants Only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN7 Select bits" name="ADCTRG2__TRGSRC7">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control Variants Only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control Variants Only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control Variants Only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control Variants Only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control Variants Only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control Variants Only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control Variants Only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control Variants Only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control Variants Only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control Variants Only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control Variants Only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control Variants Only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control Variants Only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control Variants Only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN11 Select bits" name="ADCTRG3__TRGSRC11">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN15 Select bits" name="ADCTRG4__TRGSRC15">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN19 Select bits" name="ADCTRG5__TRGSRC19">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN23 Select bits" name="ADCTRG6__TRGSRC23">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only) " name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN27 Select bits" name="ADCTRG7__TRGSRC27">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOLO">
         <value caption="Generate a Digital Comparator 0 Event when DATA &lt; DCMPLO&lt;15:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPLO ? DATA&lt;31:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHILO">
         <value caption="Generate a Digital Comparator 0 Event when DATA &lt; DCMPHI&lt;15:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHIHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPHI ? DATA&lt;31:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 ??Output True? Event Status bit" name="ADCCMPCON1__DCMPED">
         <value caption="Digital Comparator 1 output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator 1 output is false (output of comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Global Interrupt Enable bit" name="ADCCMPCON1__DCMPGIEN">
         <value caption="A Digital Comparator 1 interrupt is generated when the DCMPED status bit (ADCCMP0CON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator 1 interrupt is disabled " name="" value="0x0" />
      </value-group>
