Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
         <register caption="" name="PORTF" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RF0" />
            <bitfield mask="0x00000002" name="RF1" />
         </register>
         <register caption="" name="PORTG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x00000040" name="RG6" />
            <bitfield mask="0x00000080" name="RG7" />
            <bitfield mask="0x00000100" name="RG8" />
            <bitfield mask="0x00000200" name="RG9" />
         </register>
         <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATA0" />
            <bitfield mask="0x00000002" name="LATA1" />
            <bitfield mask="0x00000010" name="LATA4" />
            <bitfield mask="0x00000080" name="LATA7" />
            <bitfield mask="0x00000100" name="LATA8" />
            <bitfield mask="0x00000400" name="LATA10" />
            <bitfield mask="0x00000800" name="LATA11" />
            <bitfield mask="0x00001000" name="LATA12" />
         </register>
         <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB0" />
            <bitfield mask="0x00000002" name="LATB1" />
            <bitfield mask="0x00000004" name="LATB2" />
            <bitfield mask="0x00000008" name="LATB3" />
            <bitfield mask="0x00000010" name="LATB4" />
            <bitfield mask="0x00000020" name="LATB5" />
            <bitfield mask="0x00000040" name="LATB6" />
            <bitfield mask="0x00000080" name="LATB7" />
            <bitfield mask="0x00000100" name="LATB8" />
            <bitfield mask="0x00000200" name="LATB9" />
            <bitfield mask="0x00000400" name="LATB10" />
            <bitfield mask="0x00000800" name="LATB11" />
            <bitfield mask="0x00001000" name="LATB12" />
            <bitfield mask="0x00002000" name="LATB13" />
            <bitfield mask="0x00004000" name="LATB14" />
            <bitfield mask="0x00008000" name="LATB15" />
         </register>
         <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATC0" />
            <bitfield mask="0x00000002" name="LATC1" />
            <bitfield mask="0x00000004" name="LATC2" />
            <bitfield mask="0x00000040" name="LATC6" />
            <bitfield mask="0x00000080" name="LATC7" />
            <bitfield mask="0x00000100" name="LATC8" />
            <bitfield mask="0x00000200" name="LATC9" />
            <bitfield mask="0x00000400" name="LATC10" />
            <bitfield mask="0x00000800" name="LATC11" />
            <bitfield mask="0x00001000" name="LATC12" />
            <bitfield mask="0x00002000" name="LATC13" />
            <bitfield mask="0x00004000" name="LATC14" />
            <bitfield mask="0x00008000" name="LATC15" />
         </register>
         <register caption="" name="LATD" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000020" name="LATD5" />
            <bitfield mask="0x00000040" name="LATD6" />
            <bitfield mask="0x00000100" name="LATD8" />
         </register>
         <register caption="" name="LATE" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00001000" name="LATE12" />
            <bitfield mask="0x00002000" name="LATE13" />
            <bitfield mask="0x00004000" name="LATE14" />
            <bitfield mask="0x00008000" name="LATE15" />
         </register>
         <register caption="" name="LATF" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF0" />
            <bitfield mask="0x00000002" name="LATF1" />
         </register>
         <register caption="" name="LATG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x00000040" name="LATG6" />
            <bitfield mask="0x00000080" name="LATG7" />
            <bitfield mask="0x00000100" name="LATG8" />
            <bitfield mask="0x00000200" name="LATG9" />
         </register>
         <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCA0" />
            <bitfield mask="0x00000002" name="ODCA1" />
            <bitfield mask="0x00000010" name="ODCA4" />
            <bitfield mask="0x00000080" name="ODCA7" />
            <bitfield mask="0x00000100" name="ODCA8" />
            <bitfield mask="0x00000400" name="ODCA10" />
            <bitfield mask="0x00000800" name="ODCA11" />
            <bitfield mask="0x00001000" name="ODCA12" />
         </register>
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB0" />
            <bitfield mask="0x00000002" name="ODCB1" />
            <bitfield mask="0x00000004" name="ODCB2" />
            <bitfield mask="0x00000008" name="ODCB3" />
            <bitfield mask="0x00000010" name="ODCB4" />
            <bitfield mask="0x00000020" name="ODCB5" />
            <bitfield mask="0x00000040" name="ODCB6" />
            <bitfield mask="0x00000080" name="ODCB7" />
            <bitfield mask="0x00000100" name="ODCB8" />
            <bitfield mask="0x00000200" name="ODCB9" />
            <bitfield mask="0x00000400" name="ODCB10" />
            <bitfield mask="0x00000800" name="ODCB11" />
            <bitfield mask="0x00001000" name="ODCB12" />
            <bitfield mask="0x00002000" name="ODCB13" />
            <bitfield mask="0x00004000" name="ODCB14" />
            <bitfield mask="0x00008000" name="ODCB15" />
         </register>
         <register caption="" name="ODCC" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC0" />
            <bitfield mask="0x00000002" name="ODCC1" />
            <bitfield mask="0x00000004" name="ODCC2" />
            <bitfield mask="0x00000040" name="ODCC6" />
            <bitfield mask="0x00000080" name="ODCC7" />
            <bitfield mask="0x00000100" name="ODCC8" />
            <bitfield mask="0x00000200" name="ODCC9" />
            <bitfield mask="0x00000400" name="ODCC10" />
            <bitfield mask="0x00000800" name="ODCC11" />
            <bitfield mask="0x00001000" name="ODCC12" />
            <bitfield mask="0x00002000" name="ODCC13" />
            <bitfield mask="0x00004000" name="ODCC14" />
            <bitfield mask="0x00008000" name="ODCC15" />
         </register>
         <register caption="" name="ODCD" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000020" name="ODCD5" />
            <bitfield mask="0x00000040" name="ODCD6" />
            <bitfield mask="0x00000100" name="ODCD8" />
         </register>
         <register caption="" name="ODCE" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00001000" name="ODCE12" />
            <bitfield mask="0x00002000" name="ODCE13" />
            <bitfield mask="0x00004000" name="ODCE14" />
            <bitfield mask="0x00008000" name="ODCE15" />
         </register>
         <register caption="" name="ODCF" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF0" />
            <bitfield mask="0x00000002" name="ODCF1" />
         </register>
         <register caption="" name="ODCG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x00000040" name="ODCG6" />
            <bitfield mask="0x00000080" name="ODCG7" />
            <bitfield mask="0x00000100" name="ODCG8" />
            <bitfield mask="0x00000200" name="ODCG9" />
         </register>
         <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUA0" />
            <bitfield mask="0x00000002" name="CNPUA1" />
            <bitfield mask="0x00000010" name="CNPUA4" />
            <bitfield mask="0x00000080" name="CNPUA7" />
            <bitfield mask="0x00000100" name="CNPUA8" />
            <bitfield mask="0x00000400" name="CNPUA10" />
            <bitfield mask="0x00000800" name="CNPUA11" />
            <bitfield mask="0x00001000" name="CNPUA12" />
         </register>
         <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUB0" />
            <bitfield mask="0x00000002" name="CNPUB1" />
            <bitfield mask="0x00000004" name="CNPUB2" />
            <bitfield mask="0x00000008" name="CNPUB3" />
            <bitfield mask="0x00000010" name="CNPUB4" />
            <bitfield mask="0x00000020" name="CNPUB5" />
            <bitfield mask="0x00000040" name="CNPUB6" />
            <bitfield mask="0x00000080" name="CNPUB7" />
            <bitfield mask="0x00000100" name="CNPUB8" />
            <bitfield mask="0x00000200" name="CNPUB9" />
            <bitfield mask="0x00000400" name="CNPUB10" />
            <bitfield mask="0x00000800" name="CNPUB11" />
            <bitfield mask="0x00001000" name="CNPUB12" />
            <bitfield mask="0x00002000" name="CNPUB13" />
            <bitfield mask="0x00004000" name="CNPUB14" />
            <bitfield mask="0x00008000" name="CNPUB15" />
         </register>
         <register caption="" name="CNPUC" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUC0" />
            <bitfield mask="0x00000002" name="CNPUC1" />
            <bitfield mask="0x00000004" name="CNPUC2" />
            <bitfield mask="0x00000040" name="CNPUC6" />
            <bitfield mask="0x00000080" name="CNPUC7" />
            <bitfield mask="0x00000100" name="CNPUC8" />
            <bitfield mask="0x00000200" name="CNPUC9" />
            <bitfield mask="0x00000400" name="CNPUC10" />
            <bitfield mask="0x00000800" name="CNPUC11" />
            <bitfield mask="0x00001000" name="CNPUC12" />
            <bitfield mask="0x00002000" name="CNPUC13" />
            <bitfield mask="0x00004000" name="CNPUC14" />
            <bitfield mask="0x00008000" name="CNPUC15" />
         </register>
