Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
         <register caption="" name="CNPUD" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000020" name="CNPUD5" />
            <bitfield mask="0x00000040" name="CNPUD6" />
            <bitfield mask="0x00000100" name="CNPUD8" />
         </register>
         <register caption="" name="CNPUE" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00001000" name="CNPUE12" />
            <bitfield mask="0x00002000" name="CNPUE13" />
            <bitfield mask="0x00004000" name="CNPUE14" />
            <bitfield mask="0x00008000" name="CNPUE15" />
         </register>
         <register caption="" name="CNPUF" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUF0" />
            <bitfield mask="0x00000002" name="CNPUF1" />
         </register>
         <register caption="" name="CNPUG" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x00000040" name="CNPUG6" />
            <bitfield mask="0x00000080" name="CNPUG7" />
            <bitfield mask="0x00000100" name="CNPUG8" />
            <bitfield mask="0x00000200" name="CNPUG9" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA0" />
            <bitfield mask="0x00000002" name="CNPDA1" />
            <bitfield mask="0x00000010" name="CNPDA4" />
            <bitfield mask="0x00000080" name="CNPDA7" />
            <bitfield mask="0x00000100" name="CNPDA8" />
            <bitfield mask="0x00000400" name="CNPDA10" />
            <bitfield mask="0x00000800" name="CNPDA11" />
            <bitfield mask="0x00001000" name="CNPDA12" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB0" />
            <bitfield mask="0x00000002" name="CNPDB1" />
            <bitfield mask="0x00000004" name="CNPDB2" />
            <bitfield mask="0x00000008" name="CNPDB3" />
            <bitfield mask="0x00000010" name="CNPDB4" />
            <bitfield mask="0x00000020" name="CNPDB5" />
            <bitfield mask="0x00000040" name="CNPDB6" />
            <bitfield mask="0x00000080" name="CNPDB7" />
            <bitfield mask="0x00000100" name="CNPDB8" />
            <bitfield mask="0x00000200" name="CNPDB9" />
            <bitfield mask="0x00000400" name="CNPDB10" />
            <bitfield mask="0x00000800" name="CNPDB11" />
            <bitfield mask="0x00001000" name="CNPDB12" />
            <bitfield mask="0x00002000" name="CNPDB13" />
            <bitfield mask="0x00004000" name="CNPDB14" />
            <bitfield mask="0x00008000" name="CNPDB15" />
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC0" />
            <bitfield mask="0x00000002" name="CNPDC1" />
            <bitfield mask="0x00000004" name="CNPDC2" />
            <bitfield mask="0x00000040" name="CNPDC6" />
            <bitfield mask="0x00000080" name="CNPDC7" />
            <bitfield mask="0x00000100" name="CNPDC8" />
            <bitfield mask="0x00000200" name="CNPDC9" />
            <bitfield mask="0x00000400" name="CNPDC10" />
            <bitfield mask="0x00000800" name="CNPDC11" />
            <bitfield mask="0x00001000" name="CNPDC12" />
            <bitfield mask="0x00002000" name="CNPDC13" />
            <bitfield mask="0x00004000" name="CNPDC14" />
            <bitfield mask="0x00008000" name="CNPDC15" />
         </register>
         <register caption="" name="CNPDD" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000020" name="CNPDD5" />
            <bitfield mask="0x00000040" name="CNPDD6" />
            <bitfield mask="0x00000100" name="CNPDD8" />
         </register>
         <register caption="" name="CNPDE" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00001000" name="CNPDE12" />
            <bitfield mask="0x00002000" name="CNPDE13" />
            <bitfield mask="0x00004000" name="CNPDE14" />
            <bitfield mask="0x00008000" name="CNPDE15" />
         </register>
         <register caption="" name="CNPDF" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDF0" />
            <bitfield mask="0x00000002" name="CNPDF1" />
         </register>
         <register caption="" name="CNPDG" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x00000040" name="CNPDG6" />
            <bitfield mask="0x00000080" name="CNPDG7" />
            <bitfield mask="0x00000100" name="CNPDG8" />
            <bitfield mask="0x00000200" name="CNPDG9" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONE" offset="0x470" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONE__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON" />
         </register>
