Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
         <register caption="Output Compare 'x' Control Register" name="OC14CON" offset="0x21a00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC14CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC14CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC14CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC14CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC14CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC14CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC15CON" offset="0x21c00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC15CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC15CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC15CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC15CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC15CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC15CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC16CON" offset="0x21e00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC16CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC16CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC16CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC16CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC16CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC16CON__ON" />
         </register>
         <register caption="" name="OC1R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1R" />
         </register>
         <register caption="" name="OC2R" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2R" />
         </register>
         <register caption="" name="OC3R" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3R" />
         </register>
         <register caption="" name="OC4R" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4R" />
         </register>
         <register caption="" name="OC5R" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5R" />
         </register>
         <register caption="" name="OC6R" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6R" />
         </register>
         <register caption="" name="OC7R" offset="0xc10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7R" />
         </register>
         <register caption="" name="OC8R" offset="0xe10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8R" />
         </register>
         <register caption="" name="OC9R" offset="0x1010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9R" />
         </register>
         <register caption="" name="OC10R" offset="0x21210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC10R" />
         </register>
         <register caption="" name="OC11R" offset="0x21410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC11R" />
         </register>
         <register caption="" name="OC12R" offset="0x21610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC12R" />
         </register>
         <register caption="" name="OC13R" offset="0x21810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC13R" />
         </register>
         <register caption="" name="OC14R" offset="0x21a10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC14R" />
         </register>
         <register caption="" name="OC15R" offset="0x21c10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC15R" />
         </register>
         <register caption="" name="OC16R" offset="0x21e10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC16R" />
         </register>
         <register caption="" name="OC1RS" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1RS" />
         </register>
         <register caption="" name="OC2RS" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2RS" />
         </register>
         <register caption="" name="OC3RS" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3RS" />
         </register>
         <register caption="" name="OC4RS" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4RS" />
         </register>
         <register caption="" name="OC5RS" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5RS" />
         </register>
         <register caption="" name="OC6RS" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6RS" />
         </register>
         <register caption="" name="OC7RS" offset="0xc20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7RS" />
         </register>
         <register caption="" name="OC8RS" offset="0xe20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8RS" />
         </register>
