Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD064.atdf
      <value-group caption="Multiple Permission Violations Status bit" name="SBT3ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT0ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT1ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT2ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT3ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT0ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT1ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT2ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT3ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG3__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG3__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG4__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG4__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
